# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# *Пример:* 
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]
# from random import randint
# n = int (input(' Введите кол-во элементов:'))
# numbers = []
# for _ in range(n):
#     list.append(randint(1,10))
# print(list)
# print(set(list))

